app/views/restaurants/show.html.erb

    </div>
    <% if @restaurant.comments.count > 0 %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."restaurant_id" = $1  [["restaurant_id", 1]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."restaurant_id" = $1  [["restaurant_id", 1]]