app/controllers/comments_controller.rb

def create
  @comment_params = params.require(:comment).permit(:title, :body, :restaurant_id)
  comment = Comment.create(@comment_params)
---
INSERT INTO "comments" ("body", "created_at", "restaurant_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "wfwefdcwexxwqx;lwecklwejckej"], ["created_at", "2014-05-15 14:27:38.002431"], ["restaurant_id", 5], ["title", "ewfewfewef"], ["updated_at", "2014-05-15 14:27:38.002431"]]